tap "justrach/nanobrew", "https://github.com/justrach/nanobrew", trusted: true
tap "kcl-lang/tap"
tap "ublue-os/tap", "https://github.com/ublue-os/homebrew-tap", trusted: true

brew "argon2"
brew "atuin"
brew "awscli"
brew "brotli"
brew "bzip2"
brew "ca-certificates"
brew "dagger"
brew "dash-shell"
brew "expat"
brew "eza"
brew "gdbm"
brew "gettext"
brew "jq"
brew "libedit"
brew "libffi"
brew "libgit2"
brew "libidn2"
brew "libssh2"
brew "libunistring"
brew "libxcrypt"
brew "libxml2"
brew "lld"
brew "llhttp"
brew "llvm"
brew "lua"
brew "lz4"
brew "mandoc"
brew "mpdecimal"
brew "ncurses"
brew "nushell"
brew "oniguruma"
brew "openssl@3"
brew "pcre2"
brew "perl"
brew "podman-tui"
brew "python@3.14"
brew "readline"
brew "sqlite"
brew "starship"
brew "tree"
brew "ugrep"
brew "unzip"
brew "uutils-coreutils"
brew "wget"
brew "xz"
brew "z3"
brew "zip"
brew "zoxide"
brew "zstd"

cask "antigravity-ide-linux"
cask "aurora-wallpapers"
cask "bazzite-wallpapers"
cask "bluefin-wallpapers"
cask "bluefin-wallpapers-extra"
cask "firefox"
cask "framework-wallpapers"
